<template>
  <div>
    <div class="container">
      <div class="container_main">
        <p class="title">系 统 说 明 书</p>
        <div class="content">
          <p class="sub_title">一、系统简介</p>
          <p class="paragraph">
            基于煤层气时空特征产出序列研究系统是集煤层气数据管理与可视化展示、GIS空间分析与构图分析、煤层气产出预测于一体，可对较为复杂的煤层气数据和地质参数进行特征分析研究并基于时间序列进行产量预测。
          </p>
          <p>
            通常情况下，煤层气数据较为复杂且数据较为散乱，想要进行各种分析时，每个人都需要进行数据收集整理，再数据清洗，时间花费成本较高。与此同时，一般表格的数据展示，数据特征难以直观显示，将煤层气数据与地图和图表结合，可以很好的展现数据部分特性。利用图神经网络分析，需要用到GIS部分空间分析功能，通常可以利用GIS的一些桌面应用程序进行空间分析，如ARCMAP软件。但这些软件安装较为繁琐，使用效率不高。集成数据和GIS空间分析功能，利用分析结果进行模型预测，能最大化实现已有资源共享，功能统一规划运用，解决煤层气时空特征产量预测存在问题。
          </p>
          <p>
            该系统实现了用户管理、数据管理、数据与地图可视化展示、数据上传、地图编辑、空间分析、聚类分析、构图分析、构建邻接矩阵、模型预测等功能，为煤层气数据和GIS数据实现在线分析提供了一条切实可行的途径。
          </p>
        </div>
        <div class="content">
          <p class="sub_title">二、功能与结果</p>
          <p class="third_title">2.1 数据报表</p>
          <p>此项主要为了将煤层气井相关数据进行整合、清洗并可视化展示，便于用户观察数据和之后的重复使用。</p>
          <p class="con_func1">1、煤层气属性数据</p>
          <p>
            此页面主要展示樊庄509口煤层气井相关属性数据表格，该表格数据主要从数据库中获取。其中属性数据多为影响煤层气井产气量因素，主要包含四大方面，如地质因素、钻完井因素、压裂因素、排采因素。
          </p>
          <p>登录用户可以查询刷新页面，同时可以导出数据，导出文件格式可以选择Excel或者geojson。</p>
          <p class="con_func1">2、煤层气产气时间序列</p>
          <p>
            此页面主要展示樊庄509口煤层气井产气时间序列表格，该表格数据主要从数据库中获取。产气时间序列从2006年9月13日开始记录，直到2015年10月7日记录结束。其中每条时间序列首尾未记录的空格数据，标记为0；中间空格数据标记为该序列空值前后的平均值。
          </p>
          <p>登录用户可以查询刷新页面，同时可以导出数据，导出文件格式为Excel。</p>
          <p class="con_func1">3、煤层气井地理位置</p>
          <p>此页面主要在不同类型地图上可视化煤层气井地理位置，同时展示沁水县区域范围。</p>
          <p>
            登录用户可以查看聚类可视化的煤层气井，通过放大，将聚类井展示的更加细节化，同时可以直观看到各个井的具体位置。点击煤层气井标志，会弹出弹框，展示该井的部分信息。
          </p>
          <p>登录用户底层地图可以选择百度卫星地图或者百度常规地图。</p>
          <p>登录用户还可以根据煤层气井井名进行查询，实时跳转到当前查询井的位置。</p>
          <p class="con_func1">4、时间序列可视化</p>
          <p>此页面主要展示煤层气井时间序列折线图，可以更加直观的观察到数据特征。</p>
          <p>登录用户根据井名，可以查询不同井的时间序列并查看该井的折线图，同时可下载该图。</p>
          <p class="third_title">2.2 图神经网络</p>
          <p>
            此项主要利用相关数据进行聚类分析同时获取聚类结果，之后选择聚类结果中的一类，利用距离将此类构建成连接图，生成连接图谱，并在地图上展示，最后利用TGCN模型进行煤层气产量预测，分析预测结果。
          </p>
          <p class="con_func1">1、聚类</p>
          <p>此页面可以上传属性数据文件进行kmeans聚类分析，确定k值，获取聚类结果。</p>
          <p>
            登录用户可以上传csv文件，输入最大k值，生成kmeans的肘部法则图，观察该图肘部可以大致确定最佳k值，或者根据经验确定最佳k值。之后再进行聚类分析，获取聚类结果，聚类结果也可以导出成文件。
          </p>
          <p class="con_func1">2、构图</p>
          <p>
            此页面可以上传井的坐标文件，在地图上显示井的位置，同时可以输入范围，可视化煤层气井的连接状态，展示构图。
          </p>
          <p>
            登录用户可以上传csv文件，获取井的位置并在地图上展示，之后可以利用输入范围，建立井与井之间的连接，可视化构成图形。
          </p>
          <p>登录用户也可以选择底层地图为百度卫星地图或者百度常规地图。</p>
          <p class="con_func1">3、邻接矩阵</p>
          <p>此页面可以上传井的坐标文件，生成邻接矩阵，结果能被下载，之后可生成图谱并进行可视化展示。</p>
          <p>
            登录用户可以上传csv文件，生成邻接矩阵并展示，此结果可被下载。利用生成的邻接矩阵可以进行图谱可视化，此图可以更加清晰直观的看到井之间的连接关系，此结果也可被下载。
          </p>
          <p class="con_func1">4、模型预测</p>
          <p>此页面可以上传邻接矩阵和时间序列文件，同时输入训练次数，进行TGCN模型预测，获取预测结果并可视化展示。</p>
          <p>
            登录用户上传之前获取的邻接矩阵文件和时间序列文件，输入训练次数，点击模型预测，可以生成预测结果，同时获取预测误差指数，预测结果可被下载。预测完成后可以进行结果可视化，预测结果和真实数据对比展示。
          </p>
          <p class="third_title">2.3 GIS功能</p>
          <p>
            此项主要是为了配合模型预测，将需要的部分GIS空间分析功能进行整合。则此系统集空间分析与模型预测于一体，便于用户进行数据处理，提高用户体验。
          </p>
          <p class="con_func1">1、基础地图</p>
          <p>
            此页面主要展示了不同类型的地图，主要有天地图电子地图、天地图卫星图、百度电子地图、百度卫星图、高德电子地图、高德卫星图、腾讯电子地图、腾讯地形图、腾讯卫星图、ArcGIS
            REST智图地图等。
          </p>
          <p>登录用户可以选择不同类型地图进行查看，各种地图有部分区别。</p>
          <p class="con_func1">2、地图编辑</p>
          <p>
            此项主要有两部分，一个是标准图形编辑，另一个是自由图形编辑。用不同的形状在地图上进行标记，地图底图为天地图电子地图。
          </p>
          <p>
            标准图形编辑主要编辑方式有点、线、多边形、圆、正方形、长方形，编辑方式较为常规，图形绘制整齐；自由图形编辑主要编辑方式是自由的线和自由的多边形，可以随意绘制任意形状。
          </p>
          <p>
            登录用户可以选择绘制类型进行绘制，绘制标准几何时，双击结束绘制。结束绘制后，可以修改已绘制的图形，也可以停止修改，绘制中间可以点击清除画笔，选择其他画笔。若点击清空绘制，则之前绘制都会被删除。绘制自由类型时，选择画笔后，以松开鼠标左键为结束，其他和绘制标准几何一样。
          </p>
          <p class="con_func1">3、图层</p>
          <p>
            此页面主要存储上传的geojson文件，形成图层并展示在地图上。底层地图为OSM地图，图层坐标系为WGS84坐标系，可展示或隐藏。生成的图层可以查看其属性、下载为shapefile格式文件、删除该图层、显示或者隐藏该图层。查看属性时，可以导出属性为csv文件，也可以下载该geojson文件。在地图上点击显示的图层，可以查看该图层中图形的属性信息。
          </p>
          <p>
            登录用户上传geojson文件生成矢量图层后，地图直接聚焦到上传文件图层位置，在地图上点击该矢量图层，界面右侧会弹出该部分图层的详细属性信息。
          </p>
          <p>
            用户点击图层列表中属性按钮，可以查看该图层的属性，属性表中可以选择显示列，数据过多时，可以关闭不重要的列项，同时也可以全屏查看属性，更加方便观察属性。属性表中还可以下载属性csv文件，也可以下载该图层的geojson文件。
          </p>
          <p>
            用户点击图层列表上的下载，可以下载该图层的shapefile格式文件，该文件可以在一般的GIS软件中打开，如ArcGIS。
          </p>
          <p>用户点击图层列表上的删除，可以删除该图层；点击图层里列表上的“显”或“隐”，可以显示或者隐藏该图层。</p>
          <p class="con_func1">4、空间分析</p>
          <p>此项主要是利用上传的geojson文件，生成图层后，对图层进行各种空间分析。</p>
          <p class="con_func2">（1）基础分析</p>
          <p class="con_func3">● 几何凸面</p>
          <p class="con_spec">该功能可以快速确定包围整个要素的最小边界。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“几何凸面”，出现弹框后，选择需要进行分析的图层（该图层需要是Polygon几何类型），点击确定，生成新结果图层。
          </p>
          <p class="con_func3">● 几何质心</p>
          <p class="con_spec">
            该功能获取一个或多个特征，并使用所有顶点的平均值计算质心。对几何要素进行几何质心提取在实际工作中十分有用，如提取面图层中每一个要素的几何质心，然后使用质心点提取图层中的一个属性值，并在此基础上进行克里金插值，生成该属性的空间插值图。
          </p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“几何质心”，出现弹框后，选择需要进行分析的图层（该图层需要是Polygon几何类型），点击确定，生成新结果图层。
          </p>
          <p class="con_func3">● 几何并集</p>
          <p class="con_spec">该功能可以将输入图层中的多个要素合并为一个集合要素，实现要素集合层面上的合并。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“几何并集”，出现弹框后，选择需要进行分析的图层，点击确定，生成新结果图层。
          </p>
          <p class="con_func3">● 多要素溶解</p>
          <p>该功能可以将多边形进行溶解合并，如安徽省各个市级单位进行溶解合并，可以形成整个安徽省省级区域。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“多要素溶解”，出现弹框后，选择需要进行分析的图层（该图层需要是Polygon几何类型），点击确定，生成新结果图层。
          </p>
          <p class="con_func3">● 划分三角形</p>
          <p class="con_spec">该功能使用earcut算法将多边形图层分割为不规则三角形图层。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“划分三角形”，出现弹框后，选择需要进行分析的图层（该图层需要是Polygon几何类型），点击确定，生成新结果图层。
          </p>
          <p class="con_func3">● 线转面</p>
          <p class="con_spec">该功能可以将多线段的图层进行连接，转化为多边形图层。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“线转面”，出现弹框后，选择需要进行分析的图层（该图层需要是LineString或MultiLineString几何类型），点击确定，生成新结果图层。
          </p>

          <p class="con_func3">● 面转线</p>
          <p class="con_spec">该功能可以将多边形图层转化为多线段集合的图层。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“面转线”，出现弹框后，选择需要进行分析的图层（该图层需要是Polygon或MultiPolygon几何类型），点击确定，生成新结果图层。
          </p>
          <p class="con_func2">（2）缓冲区分析</p>
          <p class="con_spec">
            缓冲区是空间实体的一种影响范围或服务范围，缓冲区分析的基本思想是给定一个空间实体或集合，确定他们的邻域，邻域的大小由邻域半径确定。
          </p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“缓冲区分析”，出现弹框后，选择需要进行分析的图层，点击确定，生成新结果图层。
          </p>
          <p class="con_func2">（3）叠置分析</p>
          <p class="con_func3">● 联合</p>
          <p class="con_spec">该功能是对所选的图层进行联合，返回结果为几何对象与其他对象结合。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“联合”，出现弹框后，选择需要进行联合的两个图层，点击确定，生成新结果图层。
          </p>
          <p class="con_func3">● 相交</p>
          <p class="con_spec">该功能是对所选的图层进行相交，返回两个图层重叠部分。</p>
          <p class="con_spec">
            在功能的下拉选项列表中选择“相交”，出现弹框后，选择需要进行相交的两个图层，点击确定，生成新结果图层。
          </p>
          <p class="con_func2">（4）投影转换</p>
          <p>该功能可以将输入图层转换为不同的投影坐标。</p>
          <p>
            在功能的下拉选项列表中选择“WGS84转换为墨卡托投影”，出现弹框后，选择需要进行投影的图层，点击确定，生成新结果图层。
          </p>
          <p>
            在功能的下拉选项列表中选择“墨卡托转换为WGS84投影”，出现弹框后，选择需要进行投影的图层，点击确定，生成新结果图层。
          </p>
          <p class="con_func2">（5）裁剪</p>
          <p>该功能可以根据所选图层进行裁剪，获取该区域范围内的地图。</p>
          <p>
            在功能的下拉选项列表中选择“裁剪”，出现弹框后，选择需要进行裁剪的图层（该图层需要是只有一个要素特征的图层），点击确定，生成裁剪区域的地图，右击地图可以保存为图片。若想要重新裁剪，可以将页面重新加载或者点击“清除裁剪”。
          </p>
        </div>
        <div class="content">
          <p class="sub_title">三、注意事项</p>
          <p>1、本系统需要用户登录过后才可以进行查看数据或分析数据，若无账号，需要注册账号。</p>
          <p>2、所有输入项，需要认真阅读输入格式，否则将获取不到想要的结果。</p>
          <p>3、所有上传文件，需要仔细查看上传文件的格式要求，否则会将不能得到原来预期的分析结果。</p>
          <p>4、进行GIS功能中的空间分析时，需要注意图层选择要求，否则将提示错误，不能进行空间分析。</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Specification',
  components: {},
  data() {
    return {}
  },
  computed: {},
  methods: {},
  mounted() {}
}
</script>
<style lang="less" scoped>
.container {
  position: absolute;
  top: 2%;
  left: 1%;
  width: 87%;
  background-color: #fff;
  border-radius: 12px;
  box-shadow: 0 0 14px #cac6c6;
  .container_main {
    margin: 15px 40px;
    .title {
      text-align: center;
      font-size: 28px;
      color: #565b78;
      font-weight: 700;
      margin: 5px auto;
    }
    p {
      color: #6a74a5;
      font-size: 18px;
      font-family: 'Microsoft Yahei';
      text-indent: 2em;
      line-height: 28px;
      margin-bottom: 5px;
      letter-spacing: 2px;
    }
    .content {
      margin-bottom: 18px;
      .sub_title {
        font-size: 22px;
        font-weight: 700;
        margin-bottom: 10px;
      }
      .third_title {
        font-size: 20px;
        font-weight: 600;
        margin: 10px 0;
      }
      .con_func1 {
        font-weight: 580;
        margin-bottom: 5px;
      }
      .con_func2 {
        font-weight: 550;
        margin-bottom: 5px;
      }
      .con_func3 {
        font-weight: 550;
        margin-bottom: 5px;
        text-indent: 4em;
      }
      .con_spec {
        text-indent: 4em;
      }
    }
  }
}
</style>
